org-files/pagescreencasts2.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
#+Title: Screencasts for Seminar Datascience for Economics Part 2
#+Author: Jan Boone
#+OPTIONS: toc:2 timestamp:nil toc:nil

*Under construction*


This page contains the screencasts for the second part of the course [[file:index.org::*Course description][Seminar Datascience for Economics]]

#+TOC: headlines 2


* Dealing with data

** mortality


[[yt:921Z4AgHwNY][downloading mortality variables]]

Topics we cover in this video:
- use =eurostat.get_data_df()= to download variables directly into a =pandas= dataframe
- use the =.unique()= method to find the values of a variable
- =.rename()= to give a column a different name
- =.replace()= to change the (row) values of a column
- use =pd.melt()= to "change columns into rows"
- =.set_index= together with =.unstack()= to get variables in rows "into different columns"
- =reset_index()= removes the index hierarchy to get a dataframe without an index
- and then renaming columns with =df.columns = [' '.join(col).strip() for col in df.columns.values]=

Questions you should be able to answer before continuing:
- consider the following two statements, where we replace/rename a label:
  + =df['country'] = df['geo'].replace(eurostat_dictionary)=
  + =df.rename({'geo\\time':'geo'},inplace=True, axis=1)=
- why does the second statement use =inplace = True= and the first does not?

** GDP

[[yt:nm0V0vVfpiI][downloading gdp]]

Topics we cover in this video:
- same as above to create the dataframe for GDP
- we call this dataframe =df_n= in order to be able to merge this data in the next step:
- =merge= statement to combine this GDP data with the mortality data above

Questions you should be able to answer before continuing:
- why do we only need a =melt= statement for GDP and not =unstack=?


** Income quantiles

[[yt:Yfl-z8E3VCU][downloading income quantiles]]

Topics we cover in this video:
- same as above

Questions you should be able to answer before continuing:
- after merging the income quantiles data with the dataframe created above, in the video we get the columns =year_x= and =year_y=. Rename =year_x= to =year= and delete the column =year_y=
- [advanced] after we merged the gdp and mortality data above, we did not get columns =year_x= and =year_y=: why this difference with the merge in this video?
  + what could have done differently in the video to avoid the =year_x= and =year_y= columns?

** life style variables

[[yt:nOaNkcpnINg][downloading lifestyle variables]]

Topics we cover in this video:
- downloading the data for BMI and alcohol consumption is similar to what we did before: the columns that we want to "turn into rows" are years
- hence we can use =np.arange(2011,2021)= or even simpler =[2014]= (if we only want one year) in the =melt= statement
- at the time of making the video, the Eurostat data for smoking has the country abbreviations as columns that we want to "turn into rows"
- here we use =df_n.columns[4:]= in the melt statement

Questions you should be able to answer before continuing:
- download the alcohol data on your own
- merge the lifestyle variables into the dataframe =df= with all the variables we downloaded above
- save you dataframe =df= into the folder =data= (create this folder if you do not have it yet):
  + =df.to_csv('./data/health_data.csv')=
- we will use this data below.

* Bayesian statistics

** Introduction

[[yt:VGe2AHNkMUU][Bayes' theorem]]

Topics we cover in this video:
- [[https://en.wikipedia.org/wiki/Bayes%27_theorem][Bayes' Theorem]]: $P(A|B) = \frac{P(A and B)}{P(B)} = \frac{P(B|A)P(A)}{P(B)}$
- we will want to estimate parameters $\theta$ for a model; the posterior distribution for $\theta$ is then given by:
\begin{equation}
P(\theta | \text{data}) = \frac{P(\text{data}|\theta)*P(\theta)}{P(\text{data})}
\end{equation}
- below we will use =pymc3= (imported as =pm=) to derive the posterior distribution $P(\theta | \text{data})$:
  + the probability distribution of the parameters $\theta$ given the data that we have
- we use Bayes' theorem to find the probability that someone is a vampire, conditional on testing positive
  
Questions you should be able to answer before continuing:
- suppose you throw a coin $n$ times and $p$ is the probability of "head"; what is the probability distribution of $y$ (number of heads in $n$ throws) called?

