pagescreencasts2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Screencasts for Seminar Datascience for Economics Part 2</title>
<meta name="author" content="Jan Boone" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Screencasts for Seminar Datascience for Economics Part 2</h1>
<p>
<b>Under construction</b>
</p>


<p>
This page contains the screencasts for the second part of the course <a href="./index.html">Seminar Datascience for Economics</a>.
</p>

<p>
The videos go through the questions in <a href="https://github.com/janboone/msc_datascience/blob/master/hacking_part_2.ipynb">this notebook</a>.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org90ac1af">Dealing with data</a>
<ul>
<li><a href="#org7edadc4">mortality</a></li>
<li><a href="#orgb434bee">GDP</a></li>
<li><a href="#orgdd072eb">Income quantiles</a></li>
<li><a href="#org1123789">life style variables</a></li>
</ul>
</li>
<li><a href="#org361f08b">Bayesian statistics</a>
<ul>
<li><a href="#org619cc55">Introduction</a></li>
<li><a href="#org7208503">Simple Bayesian model</a></li>
</ul>
</li>
<li><a href="#org7c1e731">Estimating a Bayesian model</a>
<ul>
<li><a href="#orgd1a3030">formulating the model</a></li>
<li><a href="#org031694f">sampling from the model</a></li>
<li><a href="#org4501c8c">summarizing posterior distribution and model fit</a></li>
<li><a href="#orge5ffb5f">Income inequality and standardizing data</a></li>
<li><a href="#org1a7962d">Bayesian Model</a></li>
<li><a href="#orgc4a04f3">Checking model</a></li>
<li><a href="#orgdcb5484">Interactive plot with Altair</a></li>
</ul>
</li>
<li><a href="#org160aa10">Dealing with missing data the Bayesian way</a>
<ul>
<li><a href="#orgcbebab1">Masked arrays</a></li>
<li><a href="#org238b81d">Estimating model with missing observations</a></li>
</ul>
</li>
<li><a href="#org7351e8c">Bayesian time series</a>
<ul>
<li><a href="#orgd5e1d33">Gaussian process</a></li>
<li><a href="#org589a215">Covid data</a></li>
</ul>
</li>
<li><a href="#orgf0a1a1e">Bayesian neural network</a>
<ul>
<li><a href="#orgd136547">Generating the data and the grid</a></li>
<li><a href="#orgf8da38a">Code for the network</a></li>
<li><a href="#org5d87b29">Evaluating the estimated network</a></li>
<li><a href="#orgb368b16">Further graphical illustrations of the estimated network</a></li>
</ul>
</li>
<li><a href="#org88f8891">What is a confidence interval</a></li>
</ul>
</div>
</div>


<div id="outline-container-org90ac1af" class="outline-2">
<h2 id="org90ac1af">Dealing with data</h2>
<div class="outline-text-2" id="text-org90ac1af">
</div>
<div id="outline-container-org7edadc4" class="outline-3">
<h3 id="org7edadc4">mortality</h3>
<div class="outline-text-3" id="text-org7edadc4">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/921Z4AgHwNY" frameborder="0" allowfullscreen>downloading mortality variables</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use <code>eurostat.get_data_df()</code> to download variables directly into a <code>pandas</code> dataframe</li>
<li>use the <code>.unique()</code> method to find the values of a variable</li>
<li><code>.rename()</code> to give a column a different name</li>
<li><code>.replace()</code> to change the (row) values of a column</li>
<li>use <code>pd.melt()</code> to "change columns into rows"</li>
<li><code>.set_index</code> together with <code>.unstack()</code> to get variables in rows "into different columns"</li>
<li><code>reset_index()</code> removes the index hierarchy to get a dataframe without an index</li>
<li>and then renaming columns with <code>df.columns = [' '.join(col).strip() for col in df.columns.values]</code></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>consider the following two statements, where we replace/rename a label:
<ul class="org-ul">
<li><code>df['country'] = df['geo'].replace(eurostat_dictionary)</code></li>
<li><code>df.rename({'geo\\time':'geo'},inplace=True, axis=1)</code></li>
</ul></li>
<li>why does the second statement use <code>inplace = True</code> and the first does not?</li>
</ul>
</div>
</div>

<div id="outline-container-orgb434bee" class="outline-3">
<h3 id="orgb434bee">GDP</h3>
<div class="outline-text-3" id="text-orgb434bee">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/nm0V0vVfpiI" frameborder="0" allowfullscreen>downloading gdp</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>same as above to create the dataframe for GDP</li>
<li>we call this dataframe <code>df_n</code> in order to be able to merge this data in the next step:</li>
<li><code>merge</code> statement to combine this GDP data with the mortality data above</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>why do we only need a <code>melt</code> statement for GDP and not <code>unstack</code>?</li>
</ul>
</div>
</div>


<div id="outline-container-orgdd072eb" class="outline-3">
<h3 id="orgdd072eb">Income quantiles</h3>
<div class="outline-text-3" id="text-orgdd072eb">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/Yfl-z8E3VCU" frameborder="0" allowfullscreen>downloading income quantiles</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>same as above</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>after merging the income quantiles data with the dataframe created above, in the video we get the columns <code>year_x</code> and <code>year_y</code>. Rename <code>year_x</code> to <code>year</code> and delete the column <code>year_y</code></li>
<li>[advanced] after we merged the gdp and mortality data above, we did not get columns <code>year_x</code> and <code>year_y</code>: why this difference with the merge in this video?
<ul class="org-ul">
<li>what could have done differently in the video to avoid the <code>year_x</code> and <code>year_y</code> columns?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1123789" class="outline-3">
<h3 id="org1123789">life style variables</h3>
<div class="outline-text-3" id="text-org1123789">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/nOaNkcpnINg" frameborder="0" allowfullscreen>downloading lifestyle variables</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>downloading the data for BMI and alcohol consumption is similar to what we did before: the columns that we want to "turn into rows" are years</li>
<li>hence we can use <code>np.arange(2011,2021)</code> or even simpler <code>[2014]</code> (if we only want one year) in the <code>melt</code> statement</li>
<li>at the time of making the video, the Eurostat data for smoking has the country abbreviations as columns that we want to "turn into rows"</li>
<li>here we use <code>df_n.columns[4:]</code> in the melt statement</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>download the alcohol data on your own</li>
<li>merge the lifestyle variables into the dataframe <code>df</code> with all the variables we downloaded above</li>
<li>save you dataframe <code>df</code> into the folder <code>data</code> (create this folder if you do not have it yet):
<ul class="org-ul">
<li><code>df.to_csv('./data/health_data.csv')</code></li>
</ul></li>
<li>we will use this data below.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org361f08b" class="outline-2">
<h2 id="org361f08b">Bayesian statistics</h2>
<div class="outline-text-2" id="text-org361f08b">
</div>
<div id="outline-container-org619cc55" class="outline-3">
<h3 id="org619cc55">Introduction</h3>
<div class="outline-text-3" id="text-org619cc55">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/VGe2AHNkMUU" frameborder="0" allowfullscreen>Bayes' theorem</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Bayes%27_theorem">Bayes' Theorem</a>: \(P(A|B) = \frac{P(A and B)}{P(B)} = \frac{P(B|A)P(A)}{P(B)}\)</li>
<li>we will want to estimate parameters \(\theta\) for a model; the posterior distribution for \(\theta\) is then given by:</li>
</ul>
\begin{equation}
P(\theta | \text{data}) = \frac{P(\text{data}|\theta)*P(\theta)}{P(\text{data})}
\end{equation}
<ul class="org-ul">
<li>below we will use <code>pymc3</code> (imported as <code>pm</code>) to derive the posterior distribution \(P(\theta | \text{data})\):
<ul class="org-ul">
<li>the probability distribution of the parameters \(\theta\) given the data that we have</li>
</ul></li>
<li>we use Bayes' theorem to find the probability that someone is a vampire, conditional on testing positive</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>suppose you throw a coin \(n\) times and \(p\) is the probability of "head"; what is the probability distribution of \(y\) (number of heads in \(n\) throws) called?</li>
</ul>
</div>
</div>
