org-files/pagescreencasts2.org
** Simple Bayesian model

[[yt:Rlvy1ItxU0A][First Baysian model]]

Topics we cover in this video:
- [[https://en.wikipedia.org/wiki/Binomial_distribution][binomial distribution]]
- we have data on an experiment where a coin is throw up to 20 times; we see how the posterior evolves after 1, 2, 3, 4, 5 and 20 throws
- do not worry about the =pymc3= syntax yet (this will be explained in later videos)
- focus on the figure showing how the posterior distribution for =p= evolves and try to understand how different values for $y$ affect this distribution

Questions you should be able to answer before continuing:
- choose different values for =y_values= and see how this affects the development of the posterior distribution
- calculate for this posterior the probability that $p>0.8$ after throwing 20 times and $y$ value you have chosen here
  + is it bigger or smaller than the probability we find in the video? Why?


* Estimating a Bayesian model

** formulating the model

[[yt:1urA2THS46A][Model specification]]

Topics we cover in this video:
- start =pymc3= model as follows: =with pm.Model() as model_name:=
- then give the priors for the parameters of the models: =slope = pm.Normal('slope', 0,1)=
- link the model to observed variable in the data, here =df.y= (column =y= from dataframe =df=):
  + =obs = pm.Normal('obs',mu = mu, sigma = sigma, observed = df.y)=


Questions you should be able to answer before continuing:
- use =pm.sample?= to see how you can modify the number of draws from the posterior distribution

** sampling from the model

[[yt:sOl41BfFwEw][Sampling from the model]]

Topics we cover in this video:
- sample from the posterior with =trace = pm.sample()=
- the posterior predictive gives for each observation ('row') in your data, the prediction of the 'y' variable for this observation
- this is useful to check the fit of the model
- use =pm.sample_posterior_prediction(trace,varnames = ['obs'])= to generate the posterior predictive
- to capture the trace and the posterior predictive into one object use =az.from_pymc3()=
- this can be used to save the trace and posterior predictive together



Questions you should be able to answer before continuing:
- choose different parameter values in the function =generating_data()= and see how the posterior distributions for the parameters change
  + what happens to the posterior distributions for the parameters when you increase the number of observations =n=?
  + what happens if the parameter values chosen do not overlap with the priors specified in the model?
- explain the three characteristics of the trace plots that need to be satisfied to trust the sampling process
- what is "MCMC" the abbreviation of?

** summarizing posterior distribution and model fit

[[yt:Dxx8lbKDk_0][summarizing posterior and fit]]

Topics we cover in this video:
- use of =az.summary()= to summarize the posterior in a table
- the interpretation of =r_hat= in this table
- plot the original data and the 95% intervals to judge the fit of the model
  + use of =np.percentile()= to find the percentiles
  + =matplotlib.pyplot='s =vlines= to plot the percentiles as a vertical line

Questions you should be able to answer before continuing:
- what do =hdi_3%= and =hdi_97%= mean?
- what does =alpha = 0.2= mean in a plot statement?

*** Eurostat data

[[yt:gnE9K0u6p34][Loading and plotting Eurostat data]]

Topics we cover in this video:
- loading the data with =pandas='s =read_casv()=
- plotting the data with a =matplotlib= color map


** Income inequality and standardizing data

[[yt:32A_LTy5RW4][Income inequality and standardizing data]]

Topics we cover in this video:
- difference between =np.log(df[income_quantiles].mean(axis = 1))= and =(np.log(df[income_quantiles])).mean(axis = 1)=
  + i.e. order of taking the logarithm and the mean of the quantiles
- using =dropna()= to delete observations with missing values (which is, actually, a bad idea)
- defining a function =standardize()= which subtracts the mean of a variable and divides by standard deviation and then apply this function to the variables in the dataframe


Questions you should be able to answer before continuing:
- what are advantages of standardizing your data?

** Bayesian Model

[[yt:IFi50EBpXig][Bayesian model]]

Topics we cover in this video:
- we build a model to explain how log-mortality varies between countries and genders
- we use 'mortality' instead of 'obs' when linking the model to the observed (standardized) variable =log_mortality=


Questions you should be able to answer before continuing:
- explain why some priors are based on a normal distribution and others on a half-normal distribution
- use =pm.sample?= or use google to find out what the =tune= keyword does

** Checking model

[[yt:ozzR5_DXMqs][Checking the model]]

Topics we cover in this video:
- plot the original data together with 95% prediction interval for log mortality


Questions you should be able to answer before continuing:
- check the trace plots for the coefficients in =variables_health=
- when variables are standardized, what does a mean coefficient of, say, =-0.802= mean?
- re-estimate the model with preventable mortality as variable to be explained and repeat all the steps above.

** Interactive plot with Altair

[[yt:sVwuOjmcvck][Interactive Plot Altair]]

Topics we cover in this video:
- make an interactive plot with =altair='s =Chart(df)= method combined with =.encode()= and =.interactive()=
- define a year selection with =alt.selection_single()=


Questions you should be able to answer before continuing:
- make the same interactive plot with =inequality= on the horizontal axis

* Dealing with missing data the Bayesian way

