pagescreencasts2.html

<div id="outline-container-org7208503" class="outline-3">
<h3 id="org7208503">Simple Bayesian model</h3>
<div class="outline-text-3" id="text-org7208503">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/Rlvy1ItxU0A" frameborder="0" allowfullscreen>First Baysian model</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Binomial_distribution">binomial distribution</a></li>
<li>we have data on an experiment where a coin is throw up to 20 times; we see how the posterior evolves after 1, 2, 3, 4, 5 and 20 throws</li>
<li>do not worry about the <code>pymc3</code> syntax yet (this will be explained in later videos)</li>
<li>focus on the figure showing how the posterior distribution for <code>p</code> evolves and try to understand how different values for \(y\) affect this distribution</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>choose different values for <code>y_values</code> and see how this affects the development of the posterior distribution</li>
<li>calculate for this posterior the probability that \(p>0.8\) after throwing 20 times and \(y\) value you have chosen here
<ul class="org-ul">
<li>is it bigger or smaller than the probability we find in the video? Why?</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org7c1e731" class="outline-2">
<h2 id="org7c1e731">Estimating a Bayesian model</h2>
<div class="outline-text-2" id="text-org7c1e731">
</div>
<div id="outline-container-orgd1a3030" class="outline-3">
<h3 id="orgd1a3030">formulating the model</h3>
<div class="outline-text-3" id="text-orgd1a3030">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/1urA2THS46A" frameborder="0" allowfullscreen>Model specification</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>start <code>pymc3</code> model as follows: <code>with pm.Model() as model_name:</code></li>
<li>then give the priors for the parameters of the models: <code>slope = pm.Normal('slope', 0,1)</code></li>
<li>link the model to observed variable in the data, here <code>df.y</code> (column <code>y</code> from dataframe <code>df</code>):
<ul class="org-ul">
<li><code>obs = pm.Normal('obs',mu = mu, sigma = sigma, observed = df.y)</code></li>
</ul></li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>use <code>pm.sample?</code> to see how you can modify the number of draws from the posterior distribution</li>
</ul>
</div>
</div>

<div id="outline-container-org031694f" class="outline-3">
<h3 id="org031694f">sampling from the model</h3>
<div class="outline-text-3" id="text-org031694f">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/sOl41BfFwEw" frameborder="0" allowfullscreen>Sampling from the model</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>sample from the posterior with <code>trace = pm.sample()</code></li>
<li>the posterior predictive gives for each observation ('row') in your data, the prediction of the 'y' variable for this observation</li>
<li>this is useful to check the fit of the model</li>
<li>use <code>pm.sample_posterior_prediction(trace,varnames = ['obs'])</code> to generate the posterior predictive</li>
<li>to capture the trace and the posterior predictive into one object use <code>az.from_pymc3()</code></li>
<li>this can be used to save the trace and posterior predictive together</li>
</ul>



<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>choose different parameter values in the function <code>generating_data()</code> and see how the posterior distributions for the parameters change
<ul class="org-ul">
<li>what happens to the posterior distributions for the parameters when you increase the number of observations <code>n</code>?</li>
<li>what happens if the parameter values chosen do not overlap with the priors specified in the model?</li>
</ul></li>
<li>explain the three characteristics of the trace plots that need to be satisfied to trust the sampling process</li>
<li>what is "MCMC" the abbreviation of?</li>
</ul>
</div>
</div>

<div id="outline-container-org4501c8c" class="outline-3">
<h3 id="org4501c8c">summarizing posterior distribution and model fit</h3>
<div class="outline-text-3" id="text-org4501c8c">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/Dxx8lbKDk_0" frameborder="0" allowfullscreen>summarizing posterior and fit</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use of <code>az.summary()</code> to summarize the posterior in a table</li>
<li>the interpretation of <code>r_hat</code> in this table</li>
<li>plot the original data and the 95% intervals to judge the fit of the model
<ul class="org-ul">
<li>use of <code>np.percentile()</code> to find the percentiles</li>
<li><code>matplotlib.pyplot</code>'s <code>vlines</code> to plot the percentiles as a vertical line</li>
</ul></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what do <code>hdi_3%</code> and <code>hdi_97%</code> mean?</li>
<li>what does <code>alpha = 0.2</code> mean in a plot statement?</li>
</ul>
</div>

<div id="outline-container-orgfd5f291" class="outline-4">
<h4 id="orgfd5f291">Eurostat data</h4>
<div class="outline-text-4" id="text-orgfd5f291">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/gnE9K0u6p34" frameborder="0" allowfullscreen>Loading and plotting Eurostat data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>loading the data with <code>pandas</code>'s <code>read_casv()</code></li>
<li>plotting the data with a <code>matplotlib</code> color map</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orge5ffb5f" class="outline-3">
<h3 id="orge5ffb5f">Income inequality and standardizing data</h3>
<div class="outline-text-3" id="text-orge5ffb5f">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/32A_LTy5RW4" frameborder="0" allowfullscreen>Income inequality and standardizing data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>difference between <code>np.log(df[income_quantiles].mean(axis = 1))</code> and <code>(np.log(df[income_quantiles])).mean(axis = 1)</code>
<ul class="org-ul">
<li>i.e. order of taking the logarithm and the mean of the quantiles</li>
</ul></li>
<li>using <code>dropna()</code> to delete observations with missing values (which is, actually, a bad idea)</li>
<li>defining a function <code>standardize()</code> which subtracts the mean of a variable and divides by standard deviation and then apply this function to the variables in the dataframe</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what are advantages of standardizing your data?</li>
</ul>
</div>
</div>

<div id="outline-container-org1a7962d" class="outline-3">
<h3 id="org1a7962d">Bayesian Model</h3>
<div class="outline-text-3" id="text-org1a7962d">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/IFi50EBpXig" frameborder="0" allowfullscreen>Bayesian model</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we build a model to explain how log-mortality varies between countries and genders</li>
<li>we use 'mortality' instead of 'obs' when linking the model to the observed (standardized) variable <code>log_mortality</code></li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>explain why some priors are based on a normal distribution and others on a half-normal distribution</li>
<li>use <code>pm.sample?</code> or use google to find out what the <code>tune</code> keyword does</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4a04f3" class="outline-3">
<h3 id="orgc4a04f3">Checking model</h3>
<div class="outline-text-3" id="text-orgc4a04f3">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/ozzR5_DXMqs" frameborder="0" allowfullscreen>Checking the model</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>plot the original data together with 95% prediction interval for log mortality</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>check the trace plots for the coefficients in <code>variables_health</code></li>
<li>when variables are standardized, what does a mean coefficient of, say, <code>-0.802</code> mean?</li>
<li>re-estimate the model with preventable mortality as variable to be explained and repeat all the steps above.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdcb5484" class="outline-3">
<h3 id="orgdcb5484">Interactive plot with Altair</h3>
<div class="outline-text-3" id="text-orgdcb5484">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/sVwuOjmcvck" frameborder="0" allowfullscreen>Interactive Plot Altair</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>make an interactive plot with <code>altair</code>'s <code>Chart(df)</code> method combined with <code>.encode()</code> and <code>.interactive()</code></li>
<li>define a year selection with <code>alt.selection_single()</code></li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>make the same interactive plot with <code>inequality</code> on the horizontal axis</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org160aa10" class="outline-2">
<h2 id="org160aa10">Dealing with missing data the Bayesian way</h2>
<div class="outline-text-2" id="text-org160aa10">
</div>
