org-files/pagescreencasts2.org
** Masked arrays

[[yt:AicqVtR1-RI][Masked arrays]]

Topics we cover in this video:
- creating a masked array with =np.ma.array()=
- if =x= is a masked array, use =x.compressed()= to get a readable representation
- use =np.ma.masked_invalid()= to turn an existing array into a masked array


Questions you should be able to answer before continuing:
- if a masked array has 4 entriew and =mask = [0, 0, 1, 1]=, which entries are missing?

** Estimating model with missing observations

[[yt:FhjhU1CxAns][Model with missing observations]]

Topics we cover in this video:
- specify the priors for the missing variables using the =observed= keyword
- use different names (e.g. capitalized) for the variables with missing values where the missing values are drawn from the prior distribution

Questions you should be able to answer before continuing:
- summarize the posterior distribution with a table

* Bayesian time series

** Gaussian process

*** GP with exponentiated quadratic kernel

[[yt:HjoYRQDYK4E][exponentiated quadratic kernel]]

Topics we cover in this video:
- generate our own data with a trend and cyclical component
- formulate the model with a Gaussian Process:
  + =pm.gp.cov.ExpQuad()= for the kernel
  + =pm.gp.Marginal()= for the Gaussian Process
  + =.marginal_likelihood()= method on the Gaussian Process to link process to the data
- use =pm.ADVI()= to approximate the posterior and then =.sample()= to sample from this posterior

Questions you should be able to answer before continuing:
- use MCMC to sample the posterior; does this work well?
- generate a different time series and fit the GP to this data using the ADVI sampler

*** Checking fit

[[yt:0ZpJB1ROLuA][checking fit GP]]

Topics we cover in this video:
- use of =np_c= as documented [[https://numpy.org/doc/stable/reference/generated/numpy.c_.html][here]]

Questions you should be able to answer before continuing:
- what do you think of the out-of-sample prediction of this kernel?

*** GP with periodic kernel

[[yt:Kq-ZlhkGDWw][periodic kernel]]

Topics we cover in this video:
- defining the periodic kernel with
  + =pm.gp.cov.Periodic()= and =pm.gp.Marginal()=
  + defining a linear component with =pm.gp.cov.Linear()=
  + adding two GP's


Questions you should be able to answer before continuing:
- finish the analysis with the ELBO-plot, sampling from the posterior, in-sample and out-of-sample predictions
- compare the out-of-sample predictions here with the ones obtained from the exponentiated quadratic kernel: which one performs better in your view?

** Covid data

*** Getting the data from John Hopkins University

[[yt:KE-GjOb58x8][getting covid data]]

Topics we cover in this video:
- use of [[https://github.com/PayneLab/covid19pandas][pandas API]] to [[https://coronavirus.jhu.edu/about/how-to-use-our-data][John Hopkins covid data]]
- selecting data from the Netherlands


Questions you should be able to answer before continuing:
- select data from a different country and different time period

*** Bayesian exponential model

[[yt:FFU_n5r_2a8][specifying exponential model]]

Topics we cover in this video:
- specifying a non-linear relationship $y = a(1+b)^t$ to be estimated
- sample from the prior predictive distribution; these are predictions based on the prior only, without using the data
- plotting 50 samples from the prior-predictive to check whether the predictions look reasonable
- use of =zip()= with two lists to generate "coordinates"
- plotting the 95% prediction intervals


Questions you should be able to answer before continuing:
- draw prior-predictive samples from a model based on $y = e^{bt}$
- create triples =(1,4,7), (2,5,8)= etc. from the lists =[1,2,3], [4,5,6]= and =[7,8,9]=

*** Bayesian logistic model

[[yt:aytlnYqBZgA][logistic model]]

Topics we cover in this video:
- rewrite your model in terms of parameters that simplify the choice of prior distributions for these parameters
- then use =pm.Deterministic()= to generate the parameter that you actually need in your model


Questions you should be able to answer before continuing:
- get the trace with =pm.sample()=
- check the trace plot and the summary of the trace in a table
- and posterior predictive distribution with =pm.sample_posterior_predictive()=
- plot the original data together with the 95% posterior predictive interval


* Bayesian neural network

** Generating the data and the grid

[[yt:E0_KRDJX2iQ][Data and grid]]

Topics we cover in this video:
- use of =make_moons()= from =sklearn= to generate "nice" data for a supervised learning algorithm
- use =pm.floatX()= to get data of the correct type for =pymc3= (and its =theano= backbone) --don't worry if you do not understand this; usually this step is not necessary
- use of =np.mgrid[]= to generate a two dimensional grid of coordinates:
  + =np.mgrid[0:1:3j,10:11:4j]= generates a $2 \times 3 \times 4$ tensor of $(x,y)$ coordinates (first dimension),
    - going from 0 to 1 in 3 steps (the complex number =j= translates into number of steps; instead of step size; to see this try =np.mgrid[0:1:0.25,10:11:4j]= where 0.25 denotes step size)
    - going from 10 to 11 in 4 steps
  + then =np.mgrid[0:1:3j,10:11:4j].reshape(2,-1).T=
    - generates twelve (x,y) coordinates, starting with (0,10) and going to (1,11)
    - the "-1" in =reshape()= means: choose whatever dimension is necessary here for the reshape to work
      + to see this, try =.reshape(3,-1)= and =.reshape(5,-1)=; why does the latter generate an error?


Questions you should be able to answer before continuing:
- consider the integer pairs $(x,y) = (0,0), (1,0), (0,1), (2,0) ... (4,4)$; show that for 19 such pairs $(x,y)$ it the case that $x+y > 2$?

