pagescreencasts2.html
<div id="outline-container-orgcbebab1" class="outline-3">
<h3 id="orgcbebab1">Masked arrays</h3>
<div class="outline-text-3" id="text-orgcbebab1">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/AicqVtR1-RI" frameborder="0" allowfullscreen>Masked arrays</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>creating a masked array with <code>np.ma.array()</code></li>
<li>if <code>x</code> is a masked array, use <code>x.compressed()</code> to get a readable representation</li>
<li>use <code>np.ma.masked_invalid()</code> to turn an existing array into a masked array</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>if a masked array has 4 entriew and <code>mask = [0, 0, 1, 1]</code>, which entries are missing?</li>
</ul>
</div>
</div>

<div id="outline-container-org238b81d" class="outline-3">
<h3 id="org238b81d">Estimating model with missing observations</h3>
<div class="outline-text-3" id="text-org238b81d">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/FhjhU1CxAns" frameborder="0" allowfullscreen>Model with missing observations</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>specify the priors for the missing variables using the <code>observed</code> keyword</li>
<li>use different names (e.g. capitalized) for the variables with missing values where the missing values are drawn from the prior distribution</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>summarize the posterior distribution with a table</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7351e8c" class="outline-2">
<h2 id="org7351e8c">Bayesian time series</h2>
<div class="outline-text-2" id="text-org7351e8c">
</div>
<div id="outline-container-orgd5e1d33" class="outline-3">
<h3 id="orgd5e1d33">Gaussian process</h3>
<div class="outline-text-3" id="text-orgd5e1d33">
</div>
<div id="outline-container-orgb354a67" class="outline-4">
<h4 id="orgb354a67">GP with exponentiated quadratic kernel</h4>
<div class="outline-text-4" id="text-orgb354a67">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/HjoYRQDYK4E" frameborder="0" allowfullscreen>exponentiated quadratic kernel</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>generate our own data with a trend and cyclical component</li>
<li>formulate the model with a Gaussian Process:
<ul class="org-ul">
<li><code>pm.gp.cov.ExpQuad()</code> for the kernel</li>
<li><code>pm.gp.Marginal()</code> for the Gaussian Process</li>
<li><code>.marginal_likelihood()</code> method on the Gaussian Process to link process to the data</li>
</ul></li>
<li>use <code>pm.ADVI()</code> to approximate the posterior and then <code>.sample()</code> to sample from this posterior</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>use MCMC to sample the posterior; does this work well?</li>
<li>generate a different time series and fit the GP to this data using the ADVI sampler</li>
</ul>
</div>
</div>

<div id="outline-container-org22636d8" class="outline-4">
<h4 id="org22636d8">Checking fit</h4>
<div class="outline-text-4" id="text-org22636d8">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/0ZpJB1ROLuA" frameborder="0" allowfullscreen>checking fit GP</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use of <code>np_c</code> as documented <a href="https://numpy.org/doc/stable/reference/generated/numpy.c_.html">here</a></li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what do you think of the out-of-sample prediction of this kernel?</li>
</ul>
</div>
</div>

<div id="outline-container-org833f40a" class="outline-4">
<h4 id="org833f40a">GP with periodic kernel</h4>
<div class="outline-text-4" id="text-org833f40a">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/Kq-ZlhkGDWw" frameborder="0" allowfullscreen>periodic kernel</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>defining the periodic kernel with
<ul class="org-ul">
<li><code>pm.gp.cov.Periodic()</code> and <code>pm.gp.Marginal()</code></li>
<li>defining a linear component with <code>pm.gp.cov.Linear()</code></li>
<li>adding two GP's</li>
</ul></li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>finish the analysis with the ELBO-plot, sampling from the posterior, in-sample and out-of-sample predictions</li>
<li>compare the out-of-sample predictions here with the ones obtained from the exponentiated quadratic kernel: which one performs better in your view?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org589a215" class="outline-3">
<h3 id="org589a215">Covid data</h3>
<div class="outline-text-3" id="text-org589a215">
</div>
<div id="outline-container-org60e4c66" class="outline-4">
<h4 id="org60e4c66">Getting the data from John Hopkins University</h4>
<div class="outline-text-4" id="text-org60e4c66">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/KE-GjOb58x8" frameborder="0" allowfullscreen>getting covid data</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use of <a href="https://github.com/PayneLab/covid19pandas">pandas API</a> to <a href="https://coronavirus.jhu.edu/about/how-to-use-our-data">John Hopkins covid data</a></li>
<li>selecting data from the Netherlands</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>select data from a different country and different time period</li>
</ul>
</div>
</div>

<div id="outline-container-org4a4792d" class="outline-4">
<h4 id="org4a4792d">Bayesian exponential model</h4>
<div class="outline-text-4" id="text-org4a4792d">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/FFU_n5r_2a8" frameborder="0" allowfullscreen>specifying exponential model</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>specifying a non-linear relationship \(y = a(1+b)^t\) to be estimated</li>
<li>sample from the prior predictive distribution; these are predictions based on the prior only, without using the data</li>
<li>plotting 50 samples from the prior-predictive to check whether the predictions look reasonable</li>
<li>use of <code>zip()</code> with two lists to generate "coordinates"</li>
<li>plotting the 95% prediction intervals</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>draw prior-predictive samples from a model based on \(y = e^{bt}\)</li>
<li>create triples <code>(1,4,7), (2,5,8)</code> etc. from the lists <code>[1,2,3], [4,5,6]</code> and <code>[7,8,9]</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf9e8c3" class="outline-4">
<h4 id="orgcf9e8c3">Bayesian logistic model</h4>
<div class="outline-text-4" id="text-orgcf9e8c3">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/aytlnYqBZgA" frameborder="0" allowfullscreen>logistic model</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>rewrite your model in terms of parameters that simplify the choice of prior distributions for these parameters</li>
<li>then use <code>pm.Deterministic()</code> to generate the parameter that you actually need in your model</li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>get the trace with <code>pm.sample()</code></li>
<li>check the trace plot and the summary of the trace in a table</li>
<li>and posterior predictive distribution with <code>pm.sample_posterior_predictive()</code></li>
<li>plot the original data together with the 95% posterior predictive interval</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-orgf0a1a1e" class="outline-2">
<h2 id="orgf0a1a1e">Bayesian neural network</h2>
<div class="outline-text-2" id="text-orgf0a1a1e">
</div>
<div id="outline-container-orgd136547" class="outline-3">
<h3 id="orgd136547">Generating the data and the grid</h3>
<div class="outline-text-3" id="text-orgd136547">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/E0_KRDJX2iQ" frameborder="0" allowfullscreen>Data and grid</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>use of <code>make_moons()</code> from <code>sklearn</code> to generate "nice" data for a supervised learning algorithm</li>
<li>use <code>pm.floatX()</code> to get data of the correct type for <code>pymc3</code> (and its <code>theano</code> backbone) &#x2013;don't worry if you do not understand this; usually this step is not necessary</li>
<li>use of <code>np.mgrid[]</code> to generate a two dimensional grid of coordinates:
<ul class="org-ul">
<li><code>np.mgrid[0:1:3j,10:11:4j]</code> generates a \(2 \times 3 \times 4\) tensor of \((x,y)\) coordinates (first dimension),
<ul class="org-ul">
<li>going from 0 to 1 in 3 steps (the complex number <code>j</code> translates into number of steps; instead of step size; to see this try <code>np.mgrid[0:1:0.25,10:11:4j]</code> where 0.25 denotes step size)</li>
<li>going from 10 to 11 in 4 steps</li>
</ul></li>
<li>then <code>np.mgrid[0:1:3j,10:11:4j].reshape(2,-1).T</code>
<ul class="org-ul">
<li>generates twelve (x,y) coordinates, starting with (0,10) and going to (1,11)</li>
<li>the "-1" in <code>reshape()</code> means: choose whatever dimension is necessary here for the reshape to work
<ul class="org-ul">
<li>to see this, try <code>.reshape(3,-1)</code> and <code>.reshape(5,-1)</code>; why does the latter generate an error?</li>
</ul></li>
</ul></li>
</ul></li>
</ul>


<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>consider the integer pairs \((x,y) = (0,0), (1,0), (0,1), (2,0) ... (4,4)\); show that for 19 such pairs \((x,y)\) it the case that \(x+y > 2\)?</li>
</ul>
</div>
</div>
