org-files/pagescreencasts2.org
** Code for the network

[[yt:-StgJosvkaQ][code for the network]]

Topics we cover in this video:
- the model follows a standard =pymc3= model, with some additional "bells and whistles" as we are modeling a neural network:
  + the code is mainly provided as illustration; it is not necessary to fully understand the code of the model
  + but the main idea is important: the parameters/weights of a neural network can be thought of as being stochastic and hence we can consider the posterior distribution of the weights and the predictions of the network
  + weights in the first layer =weights_in_1= need to "receive" the inputs of the features (columns) in data matrix $X$ and output to the number of nodes in the first hidden layer. The =shape= keyword in =pm.Normal()= takes care of this when defining the prior for these weights
  + =testval= sometimes helps to get the sampling of the posterior going; it is like providing an initial guess in a function like =fsolve()=
  + we also specify the weights of the first and second hidden layers
  + we define the activation functions and outcomes for the three layers: =act_1, act_2, act_out=
  + these activations will be defined in terms of our inputs (data) $X$
  + in addition to this, we want to plot the predictions of the network on the grid =grid_2d= that we defined
  + for this we use =pm.Deterministic()= to define the probability =p=, which is again based on the three activation functions but now applied to =grid_2d= and not to data $X$
  + our final classification is based on the classification propability =act_out= which is based on data $X$; as there are only two classes (blue and red), this is a Bernoulli process (one draw from a Binomial distribution)
  + =theano.shared()= makes sure that variables defined outside the =pymc3= model, work inside it as well (again, do not worry about this)
- we use ADVI to sample the posterior as it is faster than MCMC



Questions you should be able to answer before continuing:
- what is the difference between =A*B= and =pm.math.dot(A,B)= for two tensors =A= and =B=? [hint: how can you find out what =pm.math.dot()= does?]


** Evaluating the estimated network

[[yt:q2gaWDjlrGU][evaluating the network]]

Topics we cover in this video:
- we plot the ELBO to see whether the optimization step in ADVI converged; we get the "inverse J" shape that we would expect
- since we draw weigths from our posterior, there is not one decision boundary, but we have a number of these; we plot the first 50 of these boundaries
  + the boundary is the contour ("iso probability line") corresponding to $p=0.5$
- this shows that in some regions we are pretty sure where the boundary lies, while in other regions the boundary varies more across posterior samples

Questions you should be able to answer before continuing:
- just for illustrative purposes: plot the 0.4 and 0.6 contours; we will use color below to plot "all contours" at once

** Further graphical illustrations of the estimated network

[[yt:eiDGXIqveA8][graphical illustration of network uncertainty]]

Topics we cover in this video:
- using a color map, we plot all probability contours (iso probability lines) at the same time
- hence, we can say things like: for this point we are 70% sure that the label is "red" where we take the average probability across posterior samples
- to get an idea of the uncertainty across samples, we plot the standard deviation of the probabilities across posterior samples

Questions you should be able to answer before continuing:
- in this case, the contour plots of the means $p$ across posterior samples and of the standard deviations across samples look very similar. Explain why this is [hint: consider the expression for the standard deviation of a binomial distribution]


* What is a confidence interval

[[yt:BVe6EYkbHQw][confidence vs credible intervals]]

Topics we cover in this video:
- we use simulations to show what a 95% confidence interval and a credible interval is
- then we check that the relevant parameter lies in the interval 95% of time

Questions you should be able to answer before continuing:
- do the analysis with different values of =n_sample, precision=; for very small values of =precision= you may have to increase =repetitions=
- if $\sigma$ is not known, we need to estimate it from the sample; in that case, we need to use the $t$-distribution to calculate the confidence interval (instead of a normal distribution). If necessary use [[https://en.wikipedia.org/wiki/Confidence_interval#Example][the example here]] and program this case to check that the confidence interval contains $\mu$ in 95% of the cases.


* template :noexport:

[[yt:][]

Topics we cover in this video:
-


Questions you should be able to answer before continuing:
-
