pagescreencasts2.html

<div id="outline-container-orgf8da38a" class="outline-3">
<h3 id="orgf8da38a">Code for the network</h3>
<div class="outline-text-3" id="text-orgf8da38a">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/-StgJosvkaQ" frameborder="0" allowfullscreen>code for the network</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>the model follows a standard <code>pymc3</code> model, with some additional "bells and whistles" as we are modeling a neural network:
<ul class="org-ul">
<li>the code is mainly provided as illustration; it is not necessary to fully understand the code of the model</li>
<li>but the main idea is important: the parameters/weights of a neural network can be thought of as being stochastic and hence we can consider the posterior distribution of the weights and the predictions of the network</li>
<li>weights in the first layer <code>weights_in_1</code> need to "receive" the inputs of the features (columns) in data matrix \(X\) and output to the number of nodes in the first hidden layer. The <code>shape</code> keyword in <code>pm.Normal()</code> takes care of this when defining the prior for these weights</li>
<li><code>testval</code> sometimes helps to get the sampling of the posterior going; it is like providing an initial guess in a function like <code>fsolve()</code></li>
<li>we also specify the weights of the first and second hidden layers</li>
<li>we define the activation functions and outcomes for the three layers: <code>act_1, act_2, act_out</code></li>
<li>these activations will be defined in terms of our inputs (data) \(X\)</li>
<li>in addition to this, we want to plot the predictions of the network on the grid <code>grid_2d</code> that we defined</li>
<li>for this we use <code>pm.Deterministic()</code> to define the probability <code>p</code>, which is again based on the three activation functions but now applied to <code>grid_2d</code> and not to data \(X\)</li>
<li>our final classification is based on the classification propability <code>act_out</code> which is based on data \(X\); as there are only two classes (blue and red), this is a Bernoulli process (one draw from a Binomial distribution)</li>
<li><code>theano.shared()</code> makes sure that variables defined outside the <code>pymc3</code> model, work inside it as well (again, do not worry about this)</li>
</ul></li>
<li>we use ADVI to sample the posterior as it is faster than MCMC</li>
</ul>



<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>what is the difference between <code>A*B</code> and <code>pm.math.dot(A,B)</code> for two tensors <code>A</code> and <code>B</code>? [hint: how can you find out what <code>pm.math.dot()</code> does?]</li>
</ul>
</div>
</div>


<div id="outline-container-org5d87b29" class="outline-3">
<h3 id="org5d87b29">Evaluating the estimated network</h3>
<div class="outline-text-3" id="text-org5d87b29">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/q2gaWDjlrGU" frameborder="0" allowfullscreen>evaluating the network</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we plot the ELBO to see whether the optimization step in ADVI converged; we get the "inverse J" shape that we would expect</li>
<li>since we draw weigths from our posterior, there is not one decision boundary, but we have a number of these; we plot the first 50 of these boundaries
<ul class="org-ul">
<li>the boundary is the contour ("iso probability line") corresponding to \(p=0.5\)</li>
</ul></li>
<li>this shows that in some regions we are pretty sure where the boundary lies, while in other regions the boundary varies more across posterior samples</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>just for illustrative purposes: plot the 0.4 and 0.6 contours; we will use color below to plot "all contours" at once</li>
</ul>
</div>
</div>

<div id="outline-container-orgb368b16" class="outline-3">
<h3 id="orgb368b16">Further graphical illustrations of the estimated network</h3>
<div class="outline-text-3" id="text-orgb368b16">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/eiDGXIqveA8" frameborder="0" allowfullscreen>graphical illustration of network uncertainty</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>using a color map, we plot all probability contours (iso probability lines) at the same time</li>
<li>hence, we can say things like: for this point we are 70% sure that the label is "red" where we take the average probability across posterior samples</li>
<li>to get an idea of the uncertainty across samples, we plot the standard deviation of the probabilities across posterior samples</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>in this case, the contour plots of the means \(p\) across posterior samples and of the standard deviations across samples look very similar. Explain why this is [hint: consider the expression for the standard deviation of a binomial distribution]</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org88f8891" class="outline-2">
<h2 id="org88f8891">What is a confidence interval</h2>
<div class="outline-text-2" id="text-org88f8891">
<p>
<iframe width="660" height="503" src="https://www.youtube.com/embed/BVe6EYkbHQw" frameborder="0" allowfullscreen>confidence vs credible intervals</iframe>
</p>

<p>
Topics we cover in this video:
</p>
<ul class="org-ul">
<li>we use simulations to show what a 95% confidence interval and a credible interval is</li>
<li>then we check that the relevant parameter lies in the interval 95% of time</li>
</ul>

<p>
Questions you should be able to answer before continuing:
</p>
<ul class="org-ul">
<li>do the analysis with different values of <code>n_sample, precision</code>; for very small values of <code>precision</code> you may have to increase <code>repetitions</code></li>
<li>if \(\sigma\) is not known, we need to estimate it from the sample; in that case, we need to use the $t$-distribution to calculate the confidence interval (instead of a normal distribution). If necessary use <a href="https://en.wikipedia.org/wiki/Confidence_interval#Example">the example here</a> and program this case to check that the confidence interval contains \(\mu\) in 95% of the cases.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
</div>
</body>
</html>
